# 1. Создайте несколько переменных разных типов.
# Проверьте к какому типу относятся созданные переменные.

a = 5
b = 'Hello'
c = 3.25

print(type(a), type(b), type(c))

